In [4]:
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns 
import numpy as np

In [5]:
dataset = pd.read_csv('CollegePlacement.csv')
dataset.head()

,College_ID,IQ,Prev_Sem_Result,CGPA,Academic_Performance,Internship_Experience,Extra_Curricular_Score,Communication_Skills,Projects_Completed,Placement
0,CLG0030,107,6.61,6.28,8,No,8,8,4,No
1,CLG0061,97,5.52,5.37,8,No,7,8,0,No
2,CLG0036,109,5.36,5.83,9,No,3,1,1,No
3,CLG0055,122,5.47,5.75,6,Yes,1,6,1,No
4,CLG0004,96,7.91,7.69,7,No,8,10,2,No

In [3]:
dataset.columns

Index(['College_ID', 'IQ', 'Prev_Sem_Result', 'CGPA', 'Academic_Performance',
       'Internship_Experience', 'Extra_Curricular_Score',
       'Communication_Skills', 'Projects_Completed', 'Placement'],
      dtype='object')

In [6]:
new_datasets = dataset.drop(['College_ID','IQ', 'Prev_Sem_Result','Extra_Curricular_Score',],axis=1)

In [5]:
new_datasets.head()

,CGPA,Academic_Performance,Internship_Experience,Communication_Skills,Projects_Completed,Placement
0,6.28,8,No,8,4,No
1,5.37,8,No,8,0,No
2,5.83,9,No,1,1,No
3,5.75,6,Yes,6,1,No
4,7.69,7,No,10,2,No

In [6]:
new_datasets.isnull().sum()

CGPA                     0
Academic_Performance     0
Internship_Experience    0
Communication_Skills     0
Projects_Completed       0
Placement                0
dtype: int64

In [7]:
new_datasets['Internship_Experience'].unique()

array(['No', 'Yes'], dtype=object)

In [8]:
new_datasets['Placement'].unique()

array(['No', 'Yes'], dtype=object)

In [9]:
# encoding the value of some colums 
new_datasets['Internship_Experience'] = dataset['Internship_Experience'].map({'Yes':1,'No':0})
new_datasets['Placement'] = dataset['Placement'].map({'Yes':1,'No':0})

In [10]:
new_datasets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   CGPA                   10000 non-null  float64
 1   Academic_Performance   10000 non-null  int64
 2   Internship_Experience  10000 non-null  int64
 3   Communication_Skills   10000 non-null  int64
 4   Projects_Completed     10000 non-null  int64
 5   Placement              10000 non-null  int64
dtypes: float64(1), int64(5)
memory usage: 468.9 KB

In [11]:
new_datasets.head()

,CGPA,Academic_Performance,Internship_Experience,Communication_Skills,Projects_Completed,Placement
0,6.28,8,0,8,4,0
1,5.37,8,0,8,0,0
2,5.83,9,0,1,1,0
3,5.75,6,1,6,1,0
4,7.69,7,0,10,2,0

In [21]:
new_datasets['Placement'].value_counts()

Placement
0    8341
1    1659
Name: count, dtype: int64

In [8]:
new_datasets['Placement'].value_counts()

Placement
No     8341
Yes    1659
Name: count, dtype: int64

In [12]:
x = new_datasets.drop(['Placement'],axis=1)
y = new_datasets['Placement']

In [15]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [16]:
x_train.shape,x_test.shape

((8000, 5), (2000, 5))

In [17]:
# standardize the dataset 
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
x_train_scaled = scaler.fit_transform(x_train)
x_test_scaled = scaler.transform(x_test)

## implementating logistic regression

In [24]:
# traning the model
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score,confusion_matrix
logistic_regression = LogisticRegression()
logistic_regression.fit(x_train_scaled,y_train)
y_pred = logistic_regression.predict(x_test)
acc_score = accuracy_score(y_test,y_pred)
print(acc_score)

cnf = confusion_matrix(y_test,y_pred)
print(cnf)

0.163
[[   0 1674]
 [   0  326]]

/Users/bhaskarrai/Desktop/100-days-/day_67/env/lib/python3.12/site-packages/sklearn/utils/validation.py:2742: UserWarning: X has feature names, but LogisticRegression was fitted without feature names
  warnings.warn(

In [ ]:
# Because of imbalance dataset it does not give to good performance

## Balancing the imbalance datasets

In [9]:
data = new_datasets

In [11]:
# encoding the value of some colums 
new_datasets['Internship_Experience'] = dataset['Internship_Experience'].map({'Yes':1,'No':0})
new_datasets['Placement'] = dataset['Placement'].map({'Yes':1,'No':0})

In [12]:
data.head()

,CGPA,Academic_Performance,Internship_Experience,Communication_Skills,Projects_Completed,Placement
0,6.28,8,0,8,4,0
1,5.37,8,0,8,0,0
2,5.83,9,0,1,1,0
3,5.75,6,1,6,1,0
4,7.69,7,0,10,2,0

In [13]:
data['Placement'].value_counts()

Placement
0    8341
1    1659
Name: count, dtype: int64

In [20]:
zeros = [x for x in data['Placement'] if x == 0]
ones = [x for x in data['Placement'] if x == 1]

In [ ]:
data['Placement'].value_counts()

Placement
0    8341
1    1659
Name: count, dtype: int64